
* summary

* without header session, default

#+HEADERS:  :results raw
#+BEGIN_SRC sh

PN="tutorial3" 
# define the variable of the Project Name, $PN

echo 'echo from the block of variable definition, $PN =' $PN

#+END_SRC

#+RESULTS:
echo from the block of variable definition, $PN = tutorial3





#+HEADERS:  :results raw
#+BEGIN_SRC sh

# echo  $PN
echo 'echo outside the block of variable definition, $PN =' $PN

#+END_SRC

#+RESULTS:
echo outside the block of variable definition, $PN =


* with header session and a blank session name


#+HEADERS:  :results raw
#+HEADERS:  :session 
#+BEGIN_SRC sh

PN="tutorial3" 
# define the variable of the Project Name, $PN

echo 'echo from the block of variable definition, $PN =' $PN

#+END_SRC

#+RESULTS:
echo from the block of variable definition, $PN = tutorial3




#+HEADERS:  :results raw
#+HEADERS:  :session 
#+BEGIN_SRC sh

# echo  $PN
echo 'echo outside the block of variable definition, $PN =' $PN

#+END_SRC

#+RESULTS:
echo outside the block of variable definition, $PN =


* templates

#+HEADERS:  :session session_name_1
#+HEADERS:  :results silent

#+HEADERS:  :results raw
#+BEGIN_SRC sh

PN="tutorial3" 
# define the variable of the Project Name, $PN

echo 'echo from the block of variable definition, $PN =' $PN

#+END_SRC
